[
    {
        "item"              :   "Work Experience",
        "type"              :   "folder",
        "options"           :   [
            {
                "item"      :   "Center for Geospatial Science and Technology",
                "position"  :   "Work From Home Full Stack Developer",
                "year"      :   "September 2022 - January 2023",
                "notes"     :   [
                    "TAPPED is a REACT WEB APP that performs statistical analysis on data from the hosted map.",
                    "Built and deployed features written in TYPESCRIPT using the ESRI JAVASCRIPT library to help allocate more than $6.5 million to water resource projects in Los Angeles and Ventura counties.",
                    "Constructed frontend pages for APIs using CRUD action specifications and mocked API responses using data created for use before deployment.",
                    "Built a backend for a user database using PHP and the Symphony framework.",
                    "Released controls and options to let users change the variables for analysis of dynamically generated reports."
                ],
                "type"      :   "link",
                "link"      :   "https://tapped-demo-csun-cgst.netlify.app/tapped/"
            },
            {
                "item"      :   "Extra Space Storage",
                "position"  :   "Assistant Store Manager",
                "year"      :   "November 2016 - September 2018",
                "notes"     :   [
                    "Raised occupancy from below 40% to consistent occupancy above 94%.",
                    "Exceeded sales number on a regular basis as established by District and Division Managers.",
                    "Repaired, maintained, and installed key operational hardware for 8 stores within the district.",
                    "Facilitated all legal and clerical responsibilities related to auctions and collections of overdue accounts."
                ],
                "type"      :   "text"
            },
            {
                "item"      :   "Nick's Pizzeria, Captain Tony's Pizza Emporium",
                "position"  :   "Cook, Customer Service, Delivery Driver",
                "year"      :   "April 2013 - November 2016",
                "notes"     :   [
                    "Received and delivered orders while focusing on order management and customer service.",
                    "Handled cash and made change in the field.",
                    "Prepared food items and ingredients for consumption while completing deliveries, orders, and daily cleaning."
                ],
                "type"      :   "text"
            },
            {
                "item"      :   "Diversified Plastics Engineering Inc.",
                "position"  :   "Laborer",
                "year"      :   "November 2009 - January 2010",
                "notes"     :   [
                    "Assisted in the installation of vacuum systems for production factories.",
                    "Positioned, joined, aligned, or sealed structural components, such as concrete wall sections or pipes.",
                    "Measured, marked, or recorded openings or distances to layout areas for construction.",
                    "Organized and distributed materials and tools according to project plans and specifications."
                ],
                "type"      :   "text"
            }
        ]
    },
    {
        "item"              :   "Education",
        "type"              :   "folder",
        "options"           :   [ 
            {
                "item"      :   "California State University Northridge",
                "position"  :   "Bachelor of Computer Science",
                "year"      :   "2024",
                "notes"     :   [
                    "Vice President of Matahacks 2020",
                    "Director of Live Performance Events with CSUN Music Entertainment Student Association 2022",
                    "Society of Musicians and Songwriters of Northridge president",
                    "Web Design, Database Design, Computer Graphics, Embedded Applications."
                ],
                "type"      :   "text"  
            },
            {
                "item"      :   "CSUN Automated Research Center for STEM: Astro Cultivator",
                "position"  :   "Senior Design Student",
                "year"      :   "2024",
                "notes"     :   [
                    "Installed and calibrated sensors using I2C connections and Python to display to user for diagnostic and automated purposes.",
                    "Created web app that displays sensor data info, real time images, and image database and user GUI."
                ],
                "type"      :   "link"
            },
            {
                "item"      :   "Antelope Valley Community College",
                "position"  :   "Associates of Business Science",
                "year"      :   "2015",
                "notes"     :   [
                    "Business Math, Macro and Micro Economics",
                    "Business Communication, Business Ethics",
                    "Business Math and English"
                ],
                "type"      :   "text"  
            }
        ]
    },
    {
        "item"              :   "Charity",
        "type"              :   "folder",
        "options"           :   [
            {
                "item"      :   "Fantastic Boss, Lancaster Moose Lodge",
                "position"  :   "Event Organizer",
                "year"      :   "2013 - 2015",
                "notes"     :   [
                    "Planned, designed, and hosted retro video game events and e-sports tournaments.",
                    "Acquired a collection of over 10 game systems and over 100 video games for display and use during events.",
                    "Established and enforced safety measures for the welfare of guests and staff during events.",
                    "Spearheaded fundraiser events that saved Lancaster Moose Lodge from bankruptcy and closure."
                ],
                "type"      :   "text"  
            }
        ]
    },
    {
        "item"              :   "Other Projects",
        "type"              :   "folder",
        "options"           :  [
            {
                "item"      :   "Order 66",
                "position"  :   "Drummer, Writer, Logistics",
                "year"      :   "2010 - Current",
                "notes"     :   [
                    "Wrote, performed, and released 6 records.", 
                    "Raised over $3,000 for touring, travel, and shows.", 
                    "Organized live events, merchandising, and promotional materials.",
                    "Sold over $7,000 in merchandise.",
                    "Drew high attendance numbers and audience engagement to live performances."],
                "type"      :   "link",
                "link"      :   "https://open.spotify.com/artist/2aNfx0rDD2GB5a2M3hQaD1?si=SYYW3V29QAiNSwwzEVHtvQ"
            }, 
            {
                "item"      :   "High Desert Musicians",
                "position"  :   "Host, Show Runner",
                "year"      :   "2013",
                "notes"     :   [
                    "Created multiple episodes for broadcast on Local access television.",
                    "Created AV Music Mixtape in collaboration with 22 different musical acts.",
                    "Produced assets including graphic designs, art, and scripts for mix tape, end cards, and presentation."
                ],
                "type"      :   "link",
                "link"      :   "https://www.youtube.com/@HighDesertMusicians"  
            }
        ]
        
    }
]